Tekla Open API Reference for Tekla Structures 2025
WeldMark.SeamVisibilityAttributes Class
 The SeamVisibilityAttributes class is the attributes class for the weld seam visibility.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.WeldMark.SeamVisibilityAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class SeamVisibilityAttributes : GenericAttributesBase
<SerializableAttribute>
Public NotInheritable Class SeamVisibilityAttributes
	Inherits GenericAttributesBase
The WeldMark.SeamVisibilityAttributes type exposes the following members.
Constructors
Name | Description
WeldMark.SeamVisibilityAttributes()
 Creates a new weld seam visibility attributes instance.
WeldMark.SeamVisibilityAttributes(Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
 Creates a new weld seam visibility attributes instance with the given attributes.
Top
Properties
Name | Description
ShowAngle
 Gets or sets a value indicating whether the seam angle is visible.
ShowContour
 Gets or sets a value indicating whether the seam contour is visible.
ShowEffectiveThroat
 Gets or sets a value indicating whether the seam effective throat is visible.
ShowFinish
 Gets or sets a value indicating whether the seam finish is visible.
ShowLength
 Gets or sets a value indicating whether the seam length is visible.
ShowPitch
 Gets or sets a value indicating whether the seam pitch is visible.
ShowPrefix
 Gets or sets a value indicating whether the seam prefix is visible.
ShowRootOpening
 Gets or sets a value indicating whether the seam root opening is visible.
ShowSize
 Gets or sets a value indicating whether the seam size is visible.
ShowType
 Gets or sets a value indicating whether the seam type is visible.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace